#  1.	Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12


# list = [1, 44, 5, 20, 31, 40, 7, 89]
# print(sum(list[1::2])) #суммирование нечетных элементов последовательности начиная со второго;

# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------

# 2.	Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]


# l = [2, 3, 6, 7, 8, 8, 9]
# print(l[0]*l[6], l[1]*l[5], l[2]*l[4], l[3]*l[3])

# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------

# 3.	Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19


# list = list(map(float, input("Enter numbers:\n").split()))
# new_list = [round(i%1,2) for i in list if i%1 != 0]
# print(max(new_list) - min(new_list))

# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------


# 4.	Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10


# КОД НЕ ВЫДАЕТ РЕЗУЛЬТАТ - ВИСНЕТ. В ОНЛАЙН РЕДАКТОРАХ ТОЖЕ. НО, ВРОДЕ ВЕРНЫЙ :)

# n = int(input('Enter DEC number: '))
# x = ''

# while n > 0:
#    x = str(n % 2) + x
#    n // 2

# print(x)

# ------------------------------------------------------------------------------------------------------------------------------------------------------
# ------------------------------------------------------------------------------------------------------------------------------------------------------


# 5.	Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21]


# k = int(input('Enter a number: '))

# f_list = []
# x, y = 1, 1
# for i in range(k - 1):
#    f_list.append(x)
#    x, y = y, x + y
# x,y = 0, 1

# for i in range(k):
#    f_list.insert(0, x)
#    x, y = y, x - y

# print(f_list)























































































